Repository: yeager/regex-tester
Catalog: po/*.po
Languages: sv

source: Any character
sv: Något tecken

source: Digit [0-9]
sv: Siffra [0-9]

source: Non-digit
sv: Icke-siffra

source: Word char [a-zA-Z0-9_]
sv: Skrifttecken [a-öA-Ö0-9_]

source: Non-word char
sv: Icke-skrifttecken

source: Whitespace
sv: Blanksteg

source: Non-whitespace
sv: Icke-blanksteg

source: Start of line
sv: Början av rad

source: End of line
sv: Slutet av rad

source: 0 or more
sv: 0 eller fler

source: 1 or more
sv: 1 eller fler

source: 0 or 1
sv: 0 eller 1

source: Exactly n
sv: Exakt n

source: Between n and m
sv: Mellan n och m

source: Capture group
sv: Fångstgrupp

source: Non-capture group
sv: Icke-fångstgrupp

source: Named group
sv: Namngiven grupp

source: Character class
sv: Teckenklass

source: Negated class
sv: Negerad klass

source: Alternation
sv: Alternering

source: Word boundary
sv: Ordgräns

source: Regex Tester
sv: Testa reguljärt uttryck

source: Toggle theme
sv: Växla tema

source: Save pattern
sv: Spara mönster

source: About
sv: Om

source: Regular Expression:
sv: Reguljärt uttryck:

source: Enter regex pattern...
sv: Ange reguljärt uttrycksmönster...

source: Case insensitive (i)
sv: Inte skiftlägeskänslig (i)

source: Multiline (m)
sv: Flerradig (m)

source: Test Text:
sv: Testa text:

source: Matches:
sv: Matchningar:

source: Saved:
sv: Sparade:

source: Delete saved
sv: Ta bort sparade

source: Regex Cheatsheet
sv: Fusklapp för reguljära uttryck

source: No matches
sv: Inga matchningar

source: (none)
sv: (ingen)

source: translator-credits
sv: Daniel Nylander <po@danielnylander.se>, 2026.

source: Visual regex testing tool
sv: Visuellt verktyg för reguljära uttryck

source: Translations
sv: Översättningar

source: Welcome
sv: Välkommen

source: Welcome to Regex Tester
sv: Välkommen till Regex-testare

source: Test and debug regular expressions. ✓ Real-time regex matching ✓ Match highlighting ✓ Group capture display
sv: Testa och felsök reguljära uttryck. ✓ Realtidsmatchning av reguljära uttryck ✓ Markering av matchningar ✓ Visning av gruppfångst

source: Get Started
sv: Kom igång
